mgo-tec/ESP32_LCD_ILI9341_SPI_V2/src/ESP32_LCD_ILI9341_SPI_V2.cpp
/*
  ESP32_LCD_ILI9341_SPI_V2.cpp - for Arduino core for the ESP32 ( Use SPI library ).
  Beta version 1.00
  ESP32_LCD_ILI9341_SPI library class has been redesigned.
  
The MIT License (MIT)

Copyright (c) 2018 Mgo-tec. All rights reserved.
Blog URL ---> https://www.mgo-tec.com

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.

Modify Display.cpp of M5stack library.
M5stack library - MIT License
Copyright (c) 2017 M5Stack
*/

#include "ESP32_LCD_ILI9341_SPI_V2.h"

//****** LCD ILI9341 ディスプレイ初期化 ***********
void ESP32_LCD_ILI9341_SPI_V2::ILI9341_Init(int8_t sck, int8_t miso, int8_t mosi, int8_t cs, int8_t dc, int8_t rst, int8_t led, uint32_t clk, bool use_hwcs){
  ESP32_LCD_ILI9341_SPI_V2::Brightness(0);

  m_sck = sck;
  m_miso = miso;
  m_mosi = mosi;
  m_cs = cs;
  m_dc = dc;
  m_rst = rst;
  m_ledpin = led;

  m_useHw_Cs = use_hwcs; //VSPI Hardware CS 
  m_Freq = clk;

  pinMode(m_rst, OUTPUT); //Set RESET pin
  pinMode(m_dc, OUTPUT); //Set Data/Command pin

  SPI.begin(m_sck, m_miso, m_mosi, m_cs); //VSPI setting

  SPI.setBitOrder(MSBFIRST);
  //ILI9341 のSPI Clock Cycle Time (Write) Minimun 100ns=10MHz
  SPI.setFrequency(clk);
  SPI.setDataMode(SPI_MODE0);
  SPI.setHwCs(m_useHw_Cs); //Set Hardware CS pin

  //Hardware Reset------------
  digitalWrite(m_rst, HIGH);
  delay(5);
  digitalWrite(m_rst, LOW);
  delay(10);
  digitalWrite(m_rst, HIGH);
  delay(121);

  if(!m_useHw_Cs){
    pinMode(m_cs, OUTPUT);
    digitalWrite(m_cs, HIGH);
    digitalWrite(m_cs, LOW);
  }
  digitalWrite(m_dc, HIGH);

  ESP32_LCD_ILI9341_SPI_V2::CommandWrite(0x38); //Idle mode OFF
  ESP32_LCD_ILI9341_SPI_V2::CommandWrite(0x3A); //COLMOD: Pixel Format Set
    ESP32_LCD_ILI9341_SPI_V2::DataWrite(0b01010101); //RGB 16 bits / pixel, MCU 16 bits / pixel
  ESP32_LCD_ILI9341_SPI_V2::CommandWrite(0x36); //MADCTL: Memory Access Control
    ESP32_LCD_ILI9341_SPI_V2::DataWrite(0b0001000); //M5stack only. D3: BGR(RGB-BGR Order control bit )="1"
    //ESP32_LCD_ILI9341_SPI_V2::DataWrite(0b00101000); //サインスマート 2.2インチ用。D3: BGR(RGB-BGR Order control bit )="1"
  ESP32_LCD_ILI9341_SPI_V2::CommandWrite(0x11); //Sleep OUT
  delay(10);

  ESP32_LCD_ILI9341_SPI_V2::CommandWrite(0x29); //Display ON

  ESP32_LCD_ILI9341_SPI_V2::Display_Clear(0, 0, 319, 239);

  if(!m_useHw_Cs) digitalWrite(m_cs, HIGH);
  ESP32_LCD_ILI9341_SPI_V2::Brightness(100);
}
//********* Display Rotation ***************************
void ESP32_LCD_ILI9341_SPI_V2::Disp_Rotation(uint8_t rot){
  uint8_t b = 0b00001000;
  switch( rot ){
    case 0: //M5stack 横表示、デフォルト
      b = 0b00001000;
      m_MAX_DISP_WIDTH_X = 320;
      m_MAX_DISP_HEIGHT_Y = 240;
      break;
    case 1: //M5stack 縦表示、デフォルト
      b = 0b10101000;
      m_MAX_DISP_WIDTH_X = 240;
      m_MAX_DISP_HEIGHT_Y = 320;
      break;
    case 2: //M5stack 横表示、上下逆
      b = 0b11001000;
      m_MAX_DISP_WIDTH_X = 320;
      m_MAX_DISP_HEIGHT_Y = 240;
      break;
    case 3: //M5stack 縦表示、上下逆
      b = 0b01101000;
      m_MAX_DISP_WIDTH_X = 240;
      m_MAX_DISP_HEIGHT_Y = 320;
      break;
    //------------------------
    case 4: //M5stack 横表示、左右反転
      b = 0b01001000;
      m_MAX_DISP_WIDTH_X = 320;
      m_MAX_DISP_HEIGHT_Y = 240;
      break;
    case 5: //M5stack 縦表示、左右反転
      b = 0b00101000;
      m_MAX_DISP_WIDTH_X = 240;
      m_MAX_DISP_HEIGHT_Y = 320;
      break;
    case 6: //M5stack 横表示、上下逆、左右反転
      b = 0b10001000;
      m_MAX_DISP_WIDTH_X = 320;
      m_MAX_DISP_HEIGHT_Y = 240;
      break;
    case 7: //M5stack 縦表示、上下逆、左右反転
      b = 0b11101000;
      m_MAX_DISP_WIDTH_X = 240;
      m_MAX_DISP_HEIGHT_Y = 320;
      break;
    //-------------------------------
    case 8: //M5stack 横表示、デフォルト、上下反転
      b = 0b10001000;
      m_MAX_DISP_WIDTH_X = 320;
      m_MAX_DISP_HEIGHT_Y = 240;
      break;
    case 9: //M5stack 縦表示、デフォルト、上下反転
      b = 0b11101000;
      m_MAX_DISP_WIDTH_X = 240;
      m_MAX_DISP_HEIGHT_Y = 320;
      break;
    case 10: //M5stack 横表示、上下逆、上下反転
      b = 0b01001000;
      m_MAX_DISP_WIDTH_X = 320;
      m_MAX_DISP_HEIGHT_Y = 240;
      break;
    case 11: //M5stack 縦表示、上下逆、上下反転
      b = 0b00101000;
      m_MAX_DISP_WIDTH_X = 240;
      m_MAX_DISP_HEIGHT_Y = 320;
      break;
    //-------------------------------
    case 12: //M5stack で表示変わらず
      b = 0b00001100;
      m_MAX_DISP_WIDTH_X = 320;
      m_MAX_DISP_HEIGHT_Y = 240;
      break;
    case 13: //M5stack で表示変わらず
      b = 0b00011000;
      m_MAX_DISP_WIDTH_X = 320;
      m_MAX_DISP_HEIGHT_Y = 240;
      break;

    //------------------------
    case 250:
      b = 0b00101000; //サインスマート販売のILI9341横正常表示(M5stack 縦pixelサイズと横pixelサイズが異なるのでノイズ)
      m_MAX_DISP_WIDTH_X = 320;
      m_MAX_DISP_HEIGHT_Y = 240;
      break;
    case 251:
      b = 0b10001000; //サインスマート販売のILI9341の縦方向表示
      m_MAX_DISP_WIDTH_X = 240;
      m_MAX_DISP_HEIGHT_Y = 320;
      break;
    default:
      break;
  }
  m_Max_Pix_X = m_MAX_DISP_WIDTH_X - 1;
  m_Max_Pix_Y = m_MAX_DISP_HEIGHT_Y - 1;
  m_FNT8x16_X_MAX = m_MAX_DISP_WIDTH_X / 8;
  m_FNT8x16_Y_MAX = m_MAX_DISP_HEIGHT_Y / 16;
  ESP32_LCD_ILI9341_SPI_V2::SPI_set_change();
  ESP32_LCD_ILI9341_SPI_V2::CommandWrite(0x36); //MADCTL: Memory Access Control
    ESP32_LCD_ILI9341_SPI_V2::DataWrite(b); //M5stack only. D3: BGR(RGB-BGR Order control bit )="1"
  if(!m_useHw_Cs) digitalWrite(m_cs, HIGH);
}
//********* 4wire SPI Data / Command write************
void ESP32_LCD_ILI9341_SPI_V2::CommandWrite(uint8_t b){
  digitalWrite(m_dc, LOW);
  SPI.write(b);
  digitalWrite(m_dc, HIGH);
}

void ESP32_LCD_ILI9341_SPI_V2::DataWrite(uint8_t b){
  SPI.write(b);
}

void ESP32_LCD_ILI9341_SPI_V2::DataWrite16(uint16_t b){
  SPI.write16(b);
}

void ESP32_LCD_ILI9341_SPI_V2::DataWrite32(uint32_t b){
  SPI.write32(b);
}

void ESP32_LCD_ILI9341_SPI_V2::DataWriteBytes(uint8_t *b, uint32_t b_size){
  SPI.writeBytes(b, b_size);
}
//**************************************************
void ESP32_LCD_ILI9341_SPI_V2::SPI_set_change(){
  SPI.setFrequency(m_Freq);
  SPI.setDataMode(SPI_MODE0);
  if(!m_useHw_Cs) digitalWrite(m_cs, LOW);
}
//******** Set Column and Page Address ( X Y range setting )***********
void ESP32_LCD_ILI9341_SPI_V2::XY_Range(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1){
  uint32_t X = (uint32_t)x0<<16 | x1;
  uint32_t Y = (uint32_t)y0<<16 | y1;

  ESP32_LCD_ILI9341_SPI_V2::CommandWrite( 0x2A ); //Set Column Address
    ESP32_LCD_ILI9341_SPI_V2::DataWrite32(X);
  ESP32_LCD_ILI9341_SPI_V2::CommandWrite( 0x2B ); //Set Page Address
    ESP32_LCD_ILI9341_SPI_V2::DataWrite32(Y);
}
//********* Display All Black Clear ******************************
void ESP32_LCD_ILI9341_SPI_V2::Display_Clear(){
  ESP32_LCD_ILI9341_SPI_V2::Display_Clear(0, 0, m_Max_Pix_X, m_Max_Pix_Y);
}
//********* Display All Black Clear ******************************
void ESP32_LCD_ILI9341_SPI_V2::Display_Clear(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1){
  if( x0 > m_Max_Pix_X ) x0 = m_Max_Pix_X;
  if( y0 > m_Max_Pix_Y ) y0 = m_Max_Pix_Y;
  if( x1 > m_Max_Pix_X ) x1 = m_Max_Pix_X;
  if( y1 > m_Max_Pix_Y ) y1 = m_Max_Pix_Y;
  uint32_t Total_Pixels = (x1 - x0 + 1) * (y1 - y0 + 1) ;
  ESP32_LCD_ILI9341_SPI_V2::Block_SPI_Fast_Write(x0, y0, x1, y1, 0, 0, 0, Total_Pixels);
}
//*********** LCD ILE9341 Block Pixel SPI Fast Write *****************
void ESP32_LCD_ILI9341_SPI_V2::Block_SPI_Fast_Write(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint8_t red, uint8_t green, uint8_t blue, uint32_t repeat){
  ESP32_LCD_ILI9341_SPI_V2::SPI_set_change();
  uint16_t ColorDot = (red << 11) | (green << 5) | blue;
  ESP32_LCD_ILI9341_SPI_V2::XY_Range(x0, y0, x1, y1);
  ESP32_LCD_ILI9341_SPI_V2::CommandWrite( 0x2C ); //LCD RAM write
  ESP32_LCD_ILI9341_SPI_V2::spiWriteBlock(ColorDot, repeat);
  if(!m_useHw_Cs) digitalWrite(m_cs, HIGH);
}
//********* Display Color Pixel Block Fast Write *****************
void ESP32_LCD_ILI9341_SPI_V2::spiWriteBlock(uint16_t color, uint32_t repeat) {
  uint16_t color16 = (color >> 8) | (color << 8);
  uint32_t color32 = color16 | color16 << 16;

  if (repeat > 15) {
    SET_PERI_REG_BITS(SPI_MOSI_DLEN_REG(_SPI_NUM), SPI_USR_MOSI_DBITLEN, 255,
                      SPI_USR_MOSI_DBITLEN_S);

    while (repeat > 15) {
      while (READ_PERI_REG(SPI_CMD_REG(_SPI_NUM)) & SPI_USR)
        ;
      for (uint32_t i = 0; i < 16; i++)
        WRITE_PERI_REG((SPI_W0_REG(_SPI_NUM) + (i << 2)), color32);
      SET_PERI_REG_MASK(SPI_CMD_REG(_SPI_NUM), SPI_USR);
      repeat -= 16;
    }
    while (READ_PERI_REG(SPI_CMD_REG(_SPI_NUM)) & SPI_USR)
      ;
  }

  if (repeat) {
    repeat = (repeat << 4) - 1;
    SET_PERI_REG_BITS(SPI_MOSI_DLEN_REG(_SPI_NUM), SPI_USR_MOSI_DBITLEN, repeat,
                      SPI_USR_MOSI_DBITLEN_S);
    for (uint32_t i = 0; i < 16; i++)
      WRITE_PERI_REG((SPI_W0_REG(_SPI_NUM) + (i << 2)), color32);
    SET_PERI_REG_MASK(SPI_CMD_REG(_SPI_NUM), SPI_USR);
    while (READ_PERI_REG(SPI_CMD_REG(_SPI_NUM)) & SPI_USR)
      ;
  }
}
//*********** 65k Color Pixel (Dot) Write ( SD card use )*************
void ESP32_LCD_ILI9341_SPI_V2::Draw_Pixel_65k_DotColor_sd(uint16_t x0, uint16_t y0, uint16_t DotColor){
  ESP32_LCD_ILI9341_SPI_V2::SPI_set_change();
  ESP32_LCD_ILI9341_SPI_V2::Draw_Pixel_65k_DotColor(x0, y0, DotColor);
  if(!m_useHw_Cs) digitalWrite(m_cs, HIGH);
}
//*********** 65k Color Pixel (Dot) Write ****************************
void ESP32_LCD_ILI9341_SPI_V2::Draw_Pixel_65k_DotColor(uint16_t x0, uint16_t y0, uint16_t DotColor){
  ESP32_LCD_ILI9341_SPI_V2::XY_Range(x0, y0, x0, y0);
  ESP32_LCD_ILI9341_SPI_V2::CommandWrite( 0x2C ); //RAM write
  ESP32_LCD_ILI9341_SPI_V2::DataWrite16( DotColor );
}
//*********** 65k Pixel RGB color Write ( SD card use )****************************
void ESP32_LCD_ILI9341_SPI_V2::Draw_Pixel_65k_3Color_sd(uint16_t x0, uint16_t y0, uint8_t red, uint8_t green, uint8_t blue){
  ESP32_LCD_ILI9341_SPI_V2::SPI_set_change();
  ESP32_LCD_ILI9341_SPI_V2::Draw_Pixel_65k_3Color(x0, y0, red, green, blue);
  if(!m_useHw_Cs) digitalWrite(m_cs, HIGH);
}
//*********** 65k Pixel RGB color Write ****************************
void ESP32_LCD_ILI9341_SPI_V2::Draw_Pixel_65k_3Color(uint16_t x0, uint16_t y0, uint8_t red, uint8_t green, uint8_t blue){
  //red (0-31), green (0-63), blue (0-31)
  ESP32_LCD_ILI9341_SPI_V2::XY_Range(x0, y0, x0, y0);

