mgo-tec/ESP32_LCD_ILI9341_SPI_V2/src/ESP32_LCD_ILI9341_SPI_V2.cpp
  uint16_t Dot = ((uint16_t)red << 11) | ((uint16_t)green << 5) | (uint16_t)blue;

  ESP32_LCD_ILI9341_SPI_V2::CommandWrite( 0x2C ); //RAM write
  ESP32_LCD_ILI9341_SPI_V2::DataWrite16( Dot );
}
//***************************************
void ESP32_LCD_ILI9341_SPI_V2::Draw_Rectangle_Line(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint8_t red, uint8_t green, uint8_t blue){
  ESP32_LCD_ILI9341_SPI_V2::Draw_Horizontal_Line(x0, x1, y0, red, green, blue);
  ESP32_LCD_ILI9341_SPI_V2::Draw_Horizontal_Line(x0, x1, y1, red, green, blue);
  ESP32_LCD_ILI9341_SPI_V2::Draw_Vertical_Line(x0, y0, y1, red, green, blue);
  ESP32_LCD_ILI9341_SPI_V2::Draw_Vertical_Line(x1, y0, y1, red, green, blue);
}
//***************************************
void ESP32_LCD_ILI9341_SPI_V2::Draw_Horizontal_Line(int16_t x0, int16_t x1, int16_t y0, uint8_t red, uint8_t green, uint8_t blue){
  if(x1 < x0) SWAP(int16_t, x0, x1);
  uint32_t Width_x = x1 - x0 + 1;
  ESP32_LCD_ILI9341_SPI_V2::Block_SPI_Fast_Write(x0, y0, x1, y0, red, green, blue, Width_x);
}
//***************************************
void ESP32_LCD_ILI9341_SPI_V2::Draw_Vertical_Line(int16_t x0, int16_t y0, int16_t y1, uint8_t red, uint8_t green, uint8_t blue){
  if(y1 < y0) SWAP(int16_t, y0, y1);
  uint16_t Width_y = y1 - y0 + 1;
  ESP32_LCD_ILI9341_SPI_V2::Block_SPI_Fast_Write(x0, y0, x0, y1, red, green, blue, Width_y);
}
//***************************************
void ESP32_LCD_ILI9341_SPI_V2::Draw_Line(int16_t x0, int16_t y0, int16_t x1, int16_t y1, uint8_t red, uint8_t green, uint8_t blue){
  ESP32_LCD_ILI9341_SPI_V2::SPI_set_change();
  int i;
  int16_t Y = 0, X = 0;
  int16_t length_x = x1 - x0;
  int16_t length_y = y1 - y0;

  uint16_t Dot = (red << 11) | (green << 5) | blue;

  if(abs(length_x) > abs(length_y)){
    float degY = ((float)length_y) / ((float)length_x);
    if(x0 < x1){
      for(i=x0; i<(x1+1); i++){
        Y = y0 + round((i-x0) * degY);
        ESP32_LCD_ILI9341_SPI_V2::Draw_Pixel_65k_DotColor(i, Y, Dot);
      }
    }else{
      for(i=x0; i>=x1; i--){
        Y = y0 + round((i-x0) * degY);
        ESP32_LCD_ILI9341_SPI_V2::Draw_Pixel_65k_DotColor(i, Y, Dot);
      }
    }
  }else{
    float degX = ((float)length_x) / ((float)length_y);

    if(y0 < y1){
      for(i=y0; i<(y1+1); i++){
        X = x0 + round((i-y0) * degX);
        ESP32_LCD_ILI9341_SPI_V2::Draw_Pixel_65k_DotColor(X, i, Dot);
      }
    }else{
      for(i=y0; i>=y1; i--){
        X = x0 + round((i-y0) * degX);
        ESP32_LCD_ILI9341_SPI_V2::Draw_Pixel_65k_DotColor(X, i, Dot);
      }
    }
  }
  if(!m_useHw_Cs) digitalWrite(m_cs, HIGH);
}
//***************************************
void ESP32_LCD_ILI9341_SPI_V2::Draw_Rectangle_Fill(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint8_t red, uint8_t green, uint8_t blue){
  uint16_t Width_x = x1 - x0 + 1;
  uint16_t Width_y = y1 - y0 + 1;
  uint32_t Total = Width_x * Width_y ;
  ESP32_LCD_ILI9341_SPI_V2::Block_SPI_Fast_Write(x0, y0, x1, y1, red, green, blue, Total);
}
//***************************************
void ESP32_LCD_ILI9341_SPI_V2::Draw_Circle_Line(uint16_t x0, uint16_t y0, uint16_t r, uint8_t red, uint8_t green, uint8_t blue){
  ESP32_LCD_ILI9341_SPI_V2::SPI_set_change();
  uint16_t x1, y1;
  float i;
  float deg = 1.0;
  if( r > 50 ) deg = 0.5;
  if( r > 110) deg = 0.25;

  uint16_t Dot = ((uint16_t)red << 11) | ((uint16_t)green << 5) | (uint16_t)blue;
  int16_t dummy_x = -1, dummy_y = -1;

  for(i=0; i<360; i=i+deg){
    x1 = round( (float)(x0 + (r * cos(radians(i)))) );
    y1 = round( (float)(y0 + (r * sin(radians(i)))) );

    if((dummy_x != x1) || (dummy_y != y1)){
      ESP32_LCD_ILI9341_SPI_V2::Draw_Pixel_65k_DotColor(x1, y1, Dot);
      dummy_x = x1;
      dummy_y = y1;
    }
  }
  if(!m_useHw_Cs) digitalWrite(m_cs, HIGH);
}
//***************************************
void ESP32_LCD_ILI9341_SPI_V2::Draw_Circle_Fill(uint16_t x0, uint16_t y0, uint16_t r, uint8_t red, uint8_t green, uint8_t blue){
  //red (0-31), green (0-63), blue (0-31)
  uint16_t x1, y1;
  float i;
  float deg = 1.0;
  //半径が大きくなると、角度の刻み方を細かくしないと、完全に塗りつぶせないので注意。
  if( r > 50 ) deg = 0.5;
  if( r > 110) deg = 0.25;

  int16_t dummy_x = -1, dummy_y = -1;
  for( i = 0; i < 360; i = i + deg ){
    x1 = round( (float)(x0 + (r * cos(radians(i)))) );
    y1 = round( (float)(y0 + (r * sin(radians(i)))) );
    if((dummy_x != x1) || (dummy_y != y1)){
      ESP32_LCD_ILI9341_SPI_V2::Draw_Vertical_Line(x1, y0, y1, red, green, blue);
      dummy_x = x1;
      dummy_y = y1;
    }
  }
}
//********* LCD Display LED Brightness **************
void ESP32_LCD_ILI9341_SPI_V2::Brightness(uint8_t brightness){
  uint8_t ledc_ch = 0;
  uint32_t valueMax = 255;
  uint32_t duty = (8191 / valueMax) * brightness;
  ledcSetup(ledc_ch, 5000, 13);
  ledcAttachPin(m_ledpin, 0);
  ledcWrite(ledc_ch, duty);
}
//************************************************
//******** 以下、フォント関数 ********************
//************************************************
uint8_t ESP32_LCD_ILI9341_SPI_V2::X_Scrolle_Font_2Array_Init( FONT_PARAM &font, ScrolleSET_PARAM &scl_set, uint16_t txt_width, uint8_t Xsize, uint8_t Ysize){
  scl_set.txt_width = txt_width;
  scl_set.txt_height = 1;
  font.Xsize = Xsize;
  font.Ysize = Ysize;
  font.PrevXsize = Xsize;
  font.PrevYsize = Ysize;

  ESP32_LCD_ILI9341_SPI_V2::Font_Param_MaxClip( font, scl_set );  
  scl_set.Scl_ArraySize1 = scl_set.txt_width * 8 * font.Xsize * 2;
  scl_set.Scl_ArraySize2 = 16;
  Serial.printf("X.Scl_ArraySize1=%d, ary_size2=%d\r\n", scl_set.Scl_ArraySize1, scl_set.Scl_ArraySize2);

  return ESP32_LCD_ILI9341_SPI_V2::Array2_New_Create( scl_set, scl_set.Scl_ArraySize1, scl_set.Scl_ArraySize2 );
}
//********************************************************************
uint8_t ESP32_LCD_ILI9341_SPI_V2::X_Scrolle_Font_2Array_Init_MAX( FONT_PARAM &font, ScrolleSET_PARAM &scl_set, uint16_t txt_width, uint8_t Xsize, uint8_t Ysize){
  scl_set.txt_width = txt_width; 
  scl_set.txt_height = 1;
  font.Xsize = Xsize;
  font.Ysize = Ysize;
  font.PrevXsize = Xsize;
  font.PrevYsize = Ysize;

  ESP32_LCD_ILI9341_SPI_V2::Font_Param_MaxClip( font, scl_set );
  txt_width = 40; //最大配列サイズにする
  scl_set.Scl_ArraySize1 = txt_width * 8 * font.Xsize * 2;
  scl_set.Scl_ArraySize2 = 16;

  return ESP32_LCD_ILI9341_SPI_V2::Array2_New_Create( scl_set, scl_set.Scl_ArraySize1, scl_set.Scl_ArraySize2 );
}
//********************************************************************
uint8_t ESP32_LCD_ILI9341_SPI_V2::Y_Scrolle_Font_2Array_Init( FONT_PARAM &font, ScrolleSET_PARAM &scl_set, uint16_t txt_height, uint8_t Xsize, uint8_t Ysize){
  scl_set.txt_width = 2;
  scl_set.txt_height = txt_height;
  font.Xsize = Xsize;
  font.Ysize = Ysize;
  font.PrevXsize = Xsize;
  font.PrevYsize = Ysize;
  //txt_heightは少数を切り上げて多めに領域確保

  ESP32_LCD_ILI9341_SPI_V2::Font_Param_MaxClip( font, scl_set );
  scl_set.Scl_ArraySize1 = 16 * font.Xsize * 2;
  scl_set.Scl_ArraySize2 = 16 * scl_set.txt_height;
  Serial.printf("Y.Scl_ArraySize1=%d, ary_size2=%d\r\n", scl_set.Scl_ArraySize1, scl_set.Scl_ArraySize2);

  return ESP32_LCD_ILI9341_SPI_V2::Array2_New_Create( scl_set, scl_set.Scl_ArraySize1, scl_set.Scl_ArraySize2 );
}
//********************************************************************
uint8_t ESP32_LCD_ILI9341_SPI_V2::Y_Scrolle_Font_2Array_Init_MAX( FONT_PARAM &font, ScrolleSET_PARAM &scl_set, uint16_t txt_height, uint8_t Xsize, uint8_t Ysize){
  scl_set.txt_width = 2;
  scl_set.txt_height = txt_height;
  font.Xsize = Xsize;
  font.Ysize = Ysize;
  font.PrevXsize = Xsize;
  font.PrevYsize = Ysize;

  ESP32_LCD_ILI9341_SPI_V2::Font_Param_MaxClip( font, scl_set );
  txt_height = 15; //最大配列サイズにする
  scl_set.Scl_ArraySize1 = 16 * font.Xsize * 2;
  scl_set.Scl_ArraySize2 = 16 * txt_height;

  return ESP32_LCD_ILI9341_SPI_V2::Array2_New_Create( scl_set, scl_set.Scl_ArraySize1, scl_set.Scl_ArraySize2 );
}
//********************************************************************
uint8_t ESP32_LCD_ILI9341_SPI_V2::Array2_New_Create( ScrolleSET_PARAM &scl_set, uint16_t ary_size1, uint16_t ary_size2){
  if( scl_set.isHeap_Create == true ){
    Serial.printf("Cannot create new heap memory.\r\n heap size = %d\r\n", esp_get_free_heap_size());
    ESP32_LCD_ILI9341_SPI_V2::Array2_Delete( scl_set );
  }
  Serial.printf("Before Create New Free Heap Size = %d\r\n", esp_get_free_heap_size());

