mgo-tec/ESP32_LCD_ILI9341_SPI_V2/src/ESP32_LCD_ILI9341_SPI_V2.cpp
  //ヒープ領域２次元配列動的確保
  scl_set.Scl_Array = new uint8_t *[ ary_size2 ];
  //if(scl_set.Scl_Array == NULL) return 0;
  int i, j;
  for(i = 0; i < ary_size2; i++) {
    scl_set.Scl_Array[ i ] = new uint8_t [ ary_size1 ];
    //if(scl_set.Scl_Array[ i ] == NULL) return 0;
  }

  for(i = 0; i < ary_size2; i++){
    for(j = 0; j < ary_size1; j++){
      scl_set.Scl_Array[i][j] = 0;
    }
  }

  scl_set.isHeap_Create = true;
  Serial.printf("After Create New Free Heap Size = %d\r\n", esp_get_free_heap_size());
  return 1;
}
//********************************************************************
void ESP32_LCD_ILI9341_SPI_V2::Array2_Delete( ScrolleSET_PARAM &scl_set ){
  if( scl_set.isHeap_Create == false ){
    Serial.printf("Cannot create delete heap memory.\r\n heap size = %d\r\n", esp_get_free_heap_size());
    Serial.println("First, you should create heap memory!");
    return;
  }
  Serial.printf("Before Delete Free Heap Size = %d\r\n", esp_get_free_heap_size());

  for (int i = 0; i < scl_set.Scl_ArraySize2; i++){
    delete[] scl_set.Scl_Array[i];
  }
  delete[] scl_set.Scl_Array;

  scl_set.isHeap_Create = false;
  Serial.printf("After Delete Free Heap Size = %d\r\n", esp_get_free_heap_size());
}
//********************************************************************
void ESP32_LCD_ILI9341_SPI_V2::Font_Param_MaxClip( FONT_PARAM &font, ScrolleSET_PARAM &scl_set ){
  if( font.x0 >= m_MAX_DISP_WIDTH_X || font.x0 < 0 ) font.x0 = 0;
  if( font.y0 >= m_MAX_DISP_HEIGHT_Y || font.y0 < 0 ) font.y0 = 0;

  scl_set.Max_Disp_x0_X = m_MAX_DISP_WIDTH_X - font.x0;
  if( scl_set.Max_Disp_x0_X < font.Xsize * 8 ){
    font.x0 = 0;
    scl_set.Max_Disp_x0_X = m_MAX_DISP_WIDTH_X;
  }
  scl_set.Max_Disp_y0_Y = m_MAX_DISP_HEIGHT_Y - font.y0;
  if( scl_set.Max_Disp_y0_Y < font.Ysize * 16 ){
    font.y0 = 0;
    scl_set.Max_Disp_y0_Y = m_MAX_DISP_HEIGHT_Y;
  }

  if(font.Xsize >= m_FNT8x16_X_MAX){
    font.Xsize = m_FNT8x16_X_MAX;
  }
  if(font.Ysize >= m_FNT8x16_Y_MAX){
    font.Ysize = m_FNT8x16_Y_MAX;  //under 15
  }

  //scl_set.txt_widthは少数を下げて文字欠けを防ぐ
  uint8_t txt_wd_max = floor((float)scl_set.Max_Disp_x0_X / (8 * font.Xsize));
  if(scl_set.txt_width > txt_wd_max){
    scl_set.txt_width = txt_wd_max;
  }
  uint8_t txt_ht_max = floor((float)scl_set.Max_Disp_y0_Y/ (16 * font.Ysize));
  if(scl_set.txt_height > txt_ht_max){
    scl_set.txt_height = txt_ht_max;
  }

  scl_set.SclPixSizeX = scl_set.txt_width * ( 8 * font.Xsize );
  if( scl_set.SclPixSizeX > scl_set.Max_Disp_x0_X ){
    scl_set.SclPixSizeX = scl_set.Max_Disp_x0_X;
  }
  scl_set.SclPixSizeY = scl_set.txt_height * ( font.Ysize * 16 );
  if( scl_set.SclPixSizeY > scl_set.Max_Disp_y0_Y ){
    scl_set.SclPixSizeY = scl_set.Max_Disp_y0_Y;
  }

  if( scl_set.XsclSendBytesNum > scl_set.Scl_ArraySize1 ){
    scl_set.XsclSendBytesNum = scl_set.Scl_ArraySize1;
  }
}
//********************************************************************
void ESP32_LCD_ILI9341_SPI_V2::Scrolle_Font_SetUp( FONT_PARAM &font, ScrolleSET_PARAM &scl_set, bool xy_range_set ){
  //void ESP32_LCD_ILI9341_SPI_V2::Scrolle_Font_SetUp(const ILI9341_FONT8X16& font, bool xy_range_set){

  //Default bg_red = 0, bg_green = 0, bg_blue = 0, x0 = 0, y0 = 0, Xsize = 1, Ysize = 1, xy_range_set = false
  
  ESP32_LCD_ILI9341_SPI_V2::Scrolle_Font_Color_Set( font );
  ESP32_LCD_ILI9341_SPI_V2::Scrolle_Form_Set( font, scl_set, scl_set.txt_width, scl_set.txt_height, font.Xsize, font.Ysize);

  if( xy_range_set ){
    ESP32_LCD_ILI9341_SPI_V2::SPI_set_change();
    ESP32_LCD_ILI9341_SPI_V2::XY_Range( font.x0, font.y0, font.x0 + scl_set.SclPixSizeX - 1, font.y0 + scl_set.SclPixSizeY - 1 );
    ESP32_LCD_ILI9341_SPI_V2::CommandWrite( 0x2C ); //RAM write
    if(!m_useHw_Cs) digitalWrite(m_cs, HIGH);
  }
  //Serial.printf("--------------------scl_set.SclPixSizeX= %d\r\n", scl_set.SclPixSizeX);
  //Serial.printf("--------------------scl_set.SclPixSizeY= %d\r\n", scl_set.SclPixSizeY);
}
//********************************************************************
void ESP32_LCD_ILI9341_SPI_V2::Scrolle_Font_Color_Set( FONT_PARAM &font ){
  //Default bg_red = 0, bg_green = 0, bg_blue = 0
  font.Dot_MSB = (font.red << 3) | (font.green >> 3);
  font.Dot_LSB = (font.green << 5) | font.blue;

  font.BG_Dot_MSB = (font.bg_red << 3) | (font.bg_green >> 3);
  font.BG_Dot_LSB = (font.bg_green << 5) | font.bg_blue;
}
//********************************************************************
void ESP32_LCD_ILI9341_SPI_V2::Scrolle_Form_Set(FONT_PARAM &font, ScrolleSET_PARAM &scl_set, uint8_t txt_width, uint8_t txt_height, uint8_t Xsize, uint8_t Ysize){
  scl_set.SclPixSizeX = txt_width * ( 8 * Xsize );
  scl_set.SclPixSizeY = txt_height * ( Ysize * 16 );
  font.Xsize = Xsize;
  font.Ysize = Ysize;
  font.PrevXsize = Xsize;
  font.PrevYsize = Ysize;

  ESP32_LCD_ILI9341_SPI_V2::Font_Param_MaxClip( font, scl_set );

  scl_set.YsclSendBytesNum = font.Xsize * 16 * 2;
}
//********************************************************************
void ESP32_LCD_ILI9341_SPI_V2::Scrolle_XYrange_Com_Change( FONT_PARAM &font, ScrolleSET_PARAM &scl_set ){
  ESP32_LCD_ILI9341_SPI_V2::SPI_set_change();
  ESP32_LCD_ILI9341_SPI_V2::XY_Range(font.x0, font.y0, font.x0 + scl_set.SclPixSizeX - 1, font.y0 + scl_set.SclPixSizeY - 1 );
  ESP32_LCD_ILI9341_SPI_V2::CommandWrite( 0x2C ); //RAM write
  if(!m_useHw_Cs) digitalWrite(m_cs, HIGH);
}
//********************************************************************
void ESP32_LCD_ILI9341_SPI_V2::Scrolle_8x16_Font( FONT_PARAM &font, ScrolleSET_PARAM &scl_set, uint16_t *fnt_cnt, const uint16_t &FontSJ_Length, uint8_t Fnt[][16], bool xy_range_set){
  //Default xy_range_set = true;
  if( millis() - scl_set.SclLastTime > scl_set.SclSpeed){
    scl_set.FontSJ_Length = FontSJ_Length;
    if( (font.Xsize != font.PrevXsize) || (font.Ysize != font.PrevYsize) ){
      ESP32_LCD_ILI9341_SPI_V2::Scrolle_Form_Set( font, scl_set,  scl_set.txt_width, scl_set.txt_height, font.Xsize, font.Ysize );
    }

    ESP32_LCD_ILI9341_SPI_V2::SPI_set_change();

    if( xy_range_set ){
      ESP32_LCD_ILI9341_SPI_V2::XY_Range(font.x0, font.y0, font.x0 + scl_set.SclPixSizeX - 1, font.y0 + scl_set.SclPixSizeY - 1 );
      ESP32_LCD_ILI9341_SPI_V2::CommandWrite( 0x2C ); //RAM write
    }

    int i, j;
    uint16_t inc_ary;
    uint8_t bt1 = 0b10000000;
    uint16_t array_max = scl_set.SclPixSizeX * 2;

    for(i = 0; i < 16; i++){
      inc_ary = scl_set.XsclSendBytesNum;
      if( Fnt[ *fnt_cnt ][ i ] & (bt1 >> scl_set.SingleFontSclCount) ){
        for( j = font.Xsize; j > 0; j-- ){
          scl_set.Scl_Array[ i ][ inc_ary++ ] = font.Dot_MSB;
          scl_set.Scl_Array[ i ][ inc_ary++ ] = font.Dot_LSB;
          if(inc_ary >= array_max) break;;
        }
      }else{
        for( j = font.Xsize; j > 0; j-- ){
          scl_set.Scl_Array[ i ][ inc_ary++ ] = font.BG_Dot_MSB;
          scl_set.Scl_Array[ i ][ inc_ary++ ] = font.BG_Dot_LSB;
          if(inc_ary >= array_max) break;
        }
      }
    }

    if( (inc_ary + 2 * font.Xsize) > array_max ) inc_ary = 0;

    int16_t now_dec_send_byteNum = array_max - inc_ary;
//Serial.printf("arry_max=%d, inc_ary=%d, now_dec_send_byteNum=%d\r\n",array_max, inc_ary, now_dec_send_byteNum);
//Serial.printf("scl_cnt=%d, fnt_cnt=%d\r\n", scl_set.SingleFontSclCount, *fnt_cnt);
    for(i = 0; i < 16; i++){
      for(j = font.Ysize; j > 0; j--){
        ESP32_LCD_ILI9341_SPI_V2::DataWriteBytes( &scl_set.Scl_Array[ i ][ inc_ary ], now_dec_send_byteNum );
        ESP32_LCD_ILI9341_SPI_V2::DataWriteBytes( &scl_set.Scl_Array[ i ][ 0 ], inc_ary );
      }
    }

    scl_set.XsclSendBytesNum = inc_ary;

    scl_set.SingleFontSclCount++;
    if( scl_set.SingleFontSclCount > 7 ){
      scl_set.SingleFontSclCount = 0;
      (*fnt_cnt)++;
      if( *fnt_cnt >= scl_set.FontSJ_Length ) {
        *fnt_cnt = 0;
      }
    }

