mgo-tec/ESP32_LCD_ILI9341_SPI_V2/src/ESP32_LCD_ILI9341_SPI_V2.cpp
    scl_set.SclLastTime = millis();
    if(!m_useHw_Cs) digitalWrite(m_cs, HIGH);
  }
}
//********************************************************************
boolean ESP32_LCD_ILI9341_SPI_V2::Scrolle_Inc_8x16_Font( FONT_PARAM &font, ScrolleSET_PARAM &scl_set, const uint16_t &fontSJ_Length, uint8_t Fnt[][16], bool xy_range_set ){
  boolean ret = false;
  scl_set.FontSJ_Length = fontSJ_Length;

  ESP32_LCD_ILI9341_SPI_V2::Scrolle_8x16_Font( font, scl_set, &scl_set.ZenOrHan_cnt, fontSJ_Length, Fnt, xy_range_set );
  if((scl_set.Zen_or_Han == 2) && (scl_set.ZenOrHan_cnt == 2)){
    scl_set.ZenOrHan_cnt = 0;
    ret = true;
  }else if((scl_set.Zen_or_Han == 1) && (scl_set.ZenOrHan_cnt == 1)){
    scl_set.ZenOrHan_cnt = 0;
    ret = true;
  }
  return ret;
}
//********************************************************************
void ESP32_LCD_ILI9341_SPI_V2::Rev_Scrolle_8x16_Font( FONT_PARAM &font, ScrolleSET_PARAM &scl_set, uint16_t *fnt_cnt, const uint16_t &fontSJ_Length, uint8_t Fnt[][16], bool xy_range_set ){
  //Default xy_range_set = true;
  //半角２文字連続の場合は、東雲フォントライブラリで全角として扱われるので、逆スクロールの場合は読み取れなくなる。
  //しかし、基本的に半角英語の逆スクロールは無いものと考え、敢えて修正しない。
  if( millis() - scl_set.SclLastTime > scl_set.SclSpeed){
    scl_set.FontSJ_Length = fontSJ_Length;
    if( (font.Xsize != font.PrevXsize) || (font.Ysize != font.PrevYsize) ){
      ESP32_LCD_ILI9341_SPI_V2::Scrolle_Form_Set( font, scl_set,  scl_set.txt_width, scl_set.txt_height, font.Xsize, font.Ysize );
    }
    ESP32_LCD_ILI9341_SPI_V2::SPI_set_change();

    if( xy_range_set ){
      ESP32_LCD_ILI9341_SPI_V2::XY_Range( font.x0, font.y0, font.x0 + scl_set.SclPixSizeX - 1, font.y0 + scl_set.SclPixSizeY - 1 );
      ESP32_LCD_ILI9341_SPI_V2::CommandWrite( 0x2C ); //RAM write
    }

    int i, j;
    uint8_t bt1 = 0b00000001;
    int dec_ary;
    uint8_t f_cnt = 0;
    uint16_t array_max = ( scl_set.SclPixSizeX ) * 2 - 1;

    if( scl_set.Zen_or_Han == 2 && (*fnt_cnt) == 0) f_cnt = 1;

    for(i = 0; i < 16; i++){
      dec_ary = array_max - scl_set.XsclSendBytesNum;
      if( Fnt[ f_cnt ][ i ] & (bt1 << scl_set.SingleFontSclCount) ){
        for( j = font.Xsize; j > 0; j-- ){
          scl_set.Scl_Array[ i ][ dec_ary-- ] = font.Dot_LSB; //正スクロールと逆のバイト配列になり、LSBが先行
          scl_set.Scl_Array[ i ][ dec_ary-- ] = font.Dot_MSB;
          if(dec_ary < 0) break;
        }
      }else{
        for( j = font.Xsize; j > 0; j-- ){
          scl_set.Scl_Array[ i ][ dec_ary-- ] = font.BG_Dot_LSB; //正スクロールと逆のバイト配列になり、LSBが先行
          scl_set.Scl_Array[ i ][ dec_ary-- ] = font.BG_Dot_MSB;
          if(dec_ary < 0) break;
        }
      }
    }

    scl_set.XsclSendBytesNum = scl_set.XsclSendBytesNum + font.Xsize * 2;
    if( scl_set.XsclSendBytesNum + 2 > array_max ) scl_set.XsclSendBytesNum = 0;

    uint16_t send_byte_max = array_max + 1;
    int16_t now_dec_send_byteNum = send_byte_max - scl_set.XsclSendBytesNum;

    if( now_dec_send_byteNum < 0 ){
      for(i = 0; i < 16; i++){
        for(j = font.Ysize; j > 0; j--){
          ESP32_LCD_ILI9341_SPI_V2::DataWriteBytes( &scl_set.Scl_Array[ i ][ 0 ], send_byte_max );
        }
      }
    }else{
      for(i = 0; i < 16; i++){
        for(j = font.Ysize; j > 0; j--){
          ESP32_LCD_ILI9341_SPI_V2::DataWriteBytes( &scl_set.Scl_Array[ i ][ now_dec_send_byteNum ], scl_set.XsclSendBytesNum );
          ESP32_LCD_ILI9341_SPI_V2::DataWriteBytes( &scl_set.Scl_Array[ i ][ 0 ], now_dec_send_byteNum );
        }
      }
    }

    if( ++scl_set.SingleFontSclCount > 7 ){
      scl_set.SingleFontSclCount = 0;
      if( ++(*fnt_cnt) >= scl_set.FontSJ_Length ) {
        *fnt_cnt = 0;
      }
    }

    scl_set.SclLastTime = millis();
    if(!m_useHw_Cs) digitalWrite(m_cs, HIGH);
  }
}
//********************************************************************
boolean ESP32_LCD_ILI9341_SPI_V2::Rev_Scrolle_Inc_8x16_Font( FONT_PARAM &font, ScrolleSET_PARAM &scl_set, const uint16_t &fontSJ_Length, uint8_t Fnt[][16], bool xy_range_set ){
  boolean ret = false;
  scl_set.FontSJ_Length = fontSJ_Length;

  ESP32_LCD_ILI9341_SPI_V2::Rev_Scrolle_8x16_Font( font, scl_set, &scl_set.ZenOrHan_cnt, fontSJ_Length, Fnt, xy_range_set );

  if((scl_set.Zen_or_Han == 2) && (scl_set.ZenOrHan_cnt == 2)){
    scl_set.ZenOrHan_cnt = 0;
    ret = true;
  }else if((scl_set.Zen_or_Han == 1) && (scl_set.ZenOrHan_cnt == 1)){
    scl_set.ZenOrHan_cnt = 0;
    ret = true;
  }
  return ret;
}
//********************************************************************
boolean ESP32_LCD_ILI9341_SPI_V2::Y_Scrolle_Inc_8x16_Font( FONT_PARAM &font, ScrolleSET_PARAM &scl_set, const uint16_t &fontSJ_Length, uint8_t Fnt[][16], bool xy_range_set ){
  //Default xy_range_set = true
  boolean ret = false;
  if( millis() - scl_set.SclLastTime > scl_set.SclSpeed){
    if( (font.Xsize != font.PrevXsize) || (font.Ysize != font.PrevYsize) ){
      ESP32_LCD_ILI9341_SPI_V2::Scrolle_Form_Set( font, scl_set,  scl_set.txt_width, scl_set.txt_height, font.Xsize, font.Ysize );
    }
    ESP32_LCD_ILI9341_SPI_V2::SPI_set_change();

    if( xy_range_set ){
      ESP32_LCD_ILI9341_SPI_V2::XY_Range(font.x0, font.y0, font.x0 + scl_set.SclPixSizeX - 1, font.y0 + scl_set.SclPixSizeY - 1 );
      ESP32_LCD_ILI9341_SPI_V2::CommandWrite( 0x2C ); //RAM write
    }

    int i, j;
    uint16_t x_count = 0;
    int bit_count = 0;
    uint8_t bt1 = 0b10000000;
    uint16_t array_Y_max = scl_set.SclPixSizeY / font.Ysize;

    for(i = 0; i < 2; i++){
      if( (i == 1) && (scl_set.Zen_or_Han == 1) ){ //半角の場合、右半分はゼロで埋める
        for( bit_count = 0; bit_count < 8; bit_count++){
          for( j = font.Xsize; j > 0; j-- ){
            scl_set.Scl_Array[ scl_set.scl_Y_cnt ][ x_count++ ] = font.BG_Dot_MSB;
            scl_set.Scl_Array[ scl_set.scl_Y_cnt ][ x_count++ ] = font.BG_Dot_LSB;
          }
        }
      }else{
        for( bit_count = 0; bit_count < 8; bit_count++){
          if( Fnt[ i ][ scl_set.SingleFontSclCount ] & (bt1 >> bit_count) ){
            for( j = font.Xsize; j > 0; j-- ){
              scl_set.Scl_Array[ scl_set.scl_Y_cnt ][ x_count++ ] = font.Dot_MSB;
              scl_set.Scl_Array[ scl_set.scl_Y_cnt ][ x_count++ ] = font.Dot_LSB;
            }
          }else{
            for( j = font.Xsize; j > 0; j-- ){
              scl_set.Scl_Array[ scl_set.scl_Y_cnt ][ x_count++ ] = font.BG_Dot_MSB;
              scl_set.Scl_Array[ scl_set.scl_Y_cnt ][ x_count++ ] = font.BG_Dot_LSB;
            }
          }
        }
      }
    }

