mgo-tec/ESP32_LCD_ILI9341_SPI_V2/src/ESP32_LCD_ILI9341_SPI_V2.cpp
    scl_set.scl_Y_cnt++; 
    if( scl_set.scl_Y_cnt >= array_Y_max ) scl_set.scl_Y_cnt = 0;

    for(i = scl_set.scl_Y_cnt; i < array_Y_max; i++){
      for(j = 0; j < font.Ysize; j++){
        ESP32_LCD_ILI9341_SPI_V2::DataWriteBytes( &scl_set.Scl_Array[ i ][ 0 ], scl_set.YsclSendBytesNum);
      }
    }
    for(i = 0; i < scl_set.scl_Y_cnt; i++){
      for(j = 0; j < font.Ysize; j++){
        ESP32_LCD_ILI9341_SPI_V2::DataWriteBytes( &scl_set.Scl_Array[ i ][ 0 ], scl_set.YsclSendBytesNum);
      }
    }

    scl_set.SingleFontSclCount++;
    if( scl_set.SingleFontSclCount > 15 ){
      scl_set.SingleFontSclCount = 0;
      ret = true;
    }

    scl_set.SclLastTime = millis();
    if(!m_useHw_Cs) digitalWrite(m_cs, HIGH);
  }
  return ret;
}
//********************************************************************
boolean ESP32_LCD_ILI9341_SPI_V2::Ydown_Scrolle_Inc_8x16_Font( FONT_PARAM &font, ScrolleSET_PARAM &scl_set, const uint16_t &fontSJ_Length, uint8_t Fnt[][16], bool xy_range_set ){
  //Default xy_range_set = true
  boolean ret = false;
  if( (millis() - scl_set.SclLastTime) > scl_set.SclSpeed){
    if( (font.Xsize != font.PrevXsize) || (font.Ysize != font.PrevYsize) ){
      ESP32_LCD_ILI9341_SPI_V2::Scrolle_Form_Set( font, scl_set,  scl_set.txt_width, scl_set.txt_height, font.Xsize, font.Ysize );
    }
    ESP32_LCD_ILI9341_SPI_V2::SPI_set_change();

    if( xy_range_set ){
      ESP32_LCD_ILI9341_SPI_V2::XY_Range(font.x0, font.y0, font.x0 + scl_set.SclPixSizeX - 1, font.y0 + scl_set.SclPixSizeY - 1 );
      ESP32_LCD_ILI9341_SPI_V2::CommandWrite( 0x2C ); //RAM write
    }

    int i, j;
    uint8_t bt1 = 0b10000000;
    uint16_t x_count = 0;
    int bit_count = 0;
    uint16_t array_Y_max = scl_set.SclPixSizeY / font.Ysize - 1;
    uint16_t scl_rev_Y_cnt = array_Y_max - scl_set.scl_Y_cnt;

    for(i = 0; i < 2; i++){
      if( (i == 1) && (scl_set.Zen_or_Han == 1) ){ //半角の場合、右半分はゼロで埋める
        for( bit_count = 0; bit_count < 8; bit_count++){
          for( j = font.Xsize; j > 0; j-- ){
            scl_set.Scl_Array[ scl_rev_Y_cnt ][ x_count++ ] = font.BG_Dot_MSB;
            scl_set.Scl_Array[ scl_rev_Y_cnt ][ x_count++ ] = font.BG_Dot_LSB;
          }
        }
      }else{
        for( bit_count = 0; bit_count < 8; bit_count++){
          if( Fnt[i][ 15 - scl_set.SingleFontSclCount ] & (bt1 >> bit_count) ){
            for( j = font.Xsize; j > 0; j-- ){
              scl_set.Scl_Array[ scl_rev_Y_cnt ][ x_count++ ] = font.Dot_MSB;
              scl_set.Scl_Array[ scl_rev_Y_cnt ][ x_count++ ] = font.Dot_LSB;
            }
          }else{
            for( j = font.Xsize; j > 0; j-- ){
              scl_set.Scl_Array[ scl_rev_Y_cnt ][ x_count++ ] = font.BG_Dot_MSB;
              scl_set.Scl_Array[ scl_rev_Y_cnt ][ x_count++ ] = font.BG_Dot_LSB;
            }
          }
        }
      }
    }

    for(i = scl_rev_Y_cnt; i <= array_Y_max; i++){
      for(j = 0; j < font.Ysize; j++){
        ESP32_LCD_ILI9341_SPI_V2::DataWriteBytes( &scl_set.Scl_Array[ i ][0], scl_set.YsclSendBytesNum);
      }
    }
    for(i = 0; i < scl_rev_Y_cnt; i++){
      for(j = 0; j < font.Ysize; j++){
        ESP32_LCD_ILI9341_SPI_V2::DataWriteBytes( &scl_set.Scl_Array[ i ][0], scl_set.YsclSendBytesNum);
      }
    }

    scl_set.scl_Y_cnt++; 
    if( scl_set.scl_Y_cnt > array_Y_max ) scl_set.scl_Y_cnt = 0;

    scl_set.SingleFontSclCount++;
    if( scl_set.SingleFontSclCount > 15 ){
      scl_set.SingleFontSclCount = 0;
      ret = true;
    }

    scl_set.SclLastTime = millis();
    if(!m_useHw_Cs) digitalWrite(m_cs, HIGH);
  }
  return ret;
}
//********************************************************************
void ESP32_LCD_ILI9341_SPI_V2::XYsizeUp_8x16_Font_DisplayOut( FONT_PARAM &font, uint16_t fontSJ_Length, uint8_t Fnt[][16] ){
  ESP32_LCD_ILI9341_SPI_V2::SPI_set_change();

  if(font.Xsize > 16) font.Xsize = 16;
  if(font.Ysize > 16) font.Ysize = 16;

  uint8_t X_txt_MAX = (uint8_t)ceilf( (float)m_FNT8x16_X_MAX / (float)font.Xsize );
  if( fontSJ_Length > X_txt_MAX) fontSJ_Length = X_txt_MAX;

  uint8_t bt = 0b00000001;
  uint8_t dot_MSB = (font.red << 3) | (font.green >> 3);
  uint8_t dot_LSB = (font.green << 5) | font.blue;

  uint8_t bg_dot_MSB = 0;
  uint8_t bg_dot_LSB = 0;
  if( (font.bg_red + font.bg_green + font.bg_blue) != 0 ){
    bg_dot_MSB = (font.bg_red << 3) | (font.bg_green >> 3);
    bg_dot_LSB = (font.bg_green << 5) | font.bg_blue;
  }

  uint8_t disp_byte[(fontSJ_Length * 8 * font.Xsize) * 2] = {};
  uint16_t byte_cnt = 0;
  uint16_t X_pix_cnt = font.x0, Y_pix_cnt = font.y0;
  uint16_t Y_tmp_range = 0;

  int i, j, k, ii, jj;
  for(i = 0; i < 16; i++){
    for(j = 0; j < fontSJ_Length; j++){
      for( k = 7; k >= 0; k--){
        if( Fnt[j][i] & (bt << k) ){
          for(ii = font.Xsize; ii > 0; ii--){
            disp_byte[byte_cnt++] = dot_MSB;
            disp_byte[byte_cnt++] = dot_LSB;
            X_pix_cnt++;
            if(X_pix_cnt > ESP32_LCD_ILI9341_SPI_V2::m_Max_Pix_X) goto EXIT_max_pixX;
          }
        }else{
          for(ii = font.Xsize; ii > 0; ii--){
            disp_byte[byte_cnt++] = bg_dot_MSB;
            disp_byte[byte_cnt++] = bg_dot_LSB;
            X_pix_cnt++;
            if(X_pix_cnt > ESP32_LCD_ILI9341_SPI_V2::m_Max_Pix_X) goto EXIT_max_pixX;
          }
        }
      }
    }

EXIT_max_pixX:

    Y_tmp_range = Y_pix_cnt + font.Ysize -1;
    if(Y_tmp_range > ESP32_LCD_ILI9341_SPI_V2::m_Max_Pix_Y) Y_tmp_range = ESP32_LCD_ILI9341_SPI_V2::m_Max_Pix_Y;
    ESP32_LCD_ILI9341_SPI_V2::XY_Range(font.x0, Y_pix_cnt, X_pix_cnt - 1, Y_tmp_range);
    ESP32_LCD_ILI9341_SPI_V2::CommandWrite( 0x2C ); //RAM write
    for(jj = 0; jj < font.Ysize; jj++){
      ESP32_LCD_ILI9341_SPI_V2::DataWriteBytes(disp_byte, byte_cnt);
      Y_pix_cnt++;
      if(Y_pix_cnt > ESP32_LCD_ILI9341_SPI_V2::m_Max_Pix_Y) goto EXIT;
    }
    X_pix_cnt = font.x0;
    byte_cnt = 0;
  }

EXIT:
  if(!m_useHw_Cs) digitalWrite(m_cs, HIGH);
}
